-- Migration: Insert organisational_member data (28 records)
-- Migrated from Supabase production on 2025-10-24

INSERT INTO organisational_member (member_id, organisation_id, post, priority) VALUES
('916b9e49-e0f6-421b-bcf8-793a9bd6b6f2', '68519c66-9c79-4ed4-a01f-f5a7378f682b', 'अध्यक्ष', 0),
('9fc41317-4c33-48dc-b7e7-fdb1c0c26d81', 'd00df3d1-209e-46d5-a180-0a9b259a1fc9', 'कार्यकारी अध्यक्ष', 0),
('0ec70b1e-727a-4fe7-bad9-d907fcc3f687', '9435f7d9-1542-49f3-99f0-bc689035734a', 'केंद्रीय अध्यक्षा', 0),
('0ec70b1e-727a-4fe7-bad9-d907fcc3f687', '68cdd20f-249d-4898-a0df-25858f335022', 'महासचिव', 0),
('9fc41317-4c33-48dc-b7e7-fdb1c0c26d81', 'd2c9fbe7-b1cb-4e2d-b299-11c1bcebcfaf', 'राष्ट्रीय अध्यक्ष', 0),
('bd3bf7ea-55e3-46a4-9c50-dcf8465960e1', '7a3fb589-6661-4d2f-92dd-955f25e617c3', 'अध्यक्ष', 1),
('73e844be-421b-4ecb-aa9a-748c7fab186a', 'dad1b814-1c93-4865-ab90-dbb8f6591aa3', 'अध्यक्ष', 1),
('32c00aed-09ce-4237-a275-6e6aa2604e91', 'a0e4e581-7604-4ee3-aee0-c90440a99327', 'अध्यक्ष', 1),
('3022ed40-c849-4ce6-bfe3-d45ffd9e6e6b', '2629c754-c8aa-4fef-b721-3a2201661b99', 'अध्यक्ष', 1),
('02b79028-8d01-4d2d-9549-c07a7483beaf', '68cdd20f-249d-4898-a0df-25858f335022', 'अध्यक्षा', 1),
('a5e86746-1a65-4f03-8204-3133591f46bc', '561ab956-97d6-4aae-b696-f0f523b8b2f7', 'केंद्रीय अध्यक्ष', 1),
('bd4d37ae-ee0c-42b5-96f9-445712032362', '9435f7d9-1542-49f3-99f0-bc689035734a', 'केंद्रीय कोषाध्यक्षा', 1),
('b1b532b6-a404-4b36-9cce-8baeeafaf915', '68519c66-9c79-4ed4-a01f-f5a7378f682b', 'महासचिव', 1),
('5d7e60ef-8935-49b4-aa0d-8ce20da64c2d', 'd00df3d1-209e-46d5-a180-0a9b259a1fc9', 'सचिव', 1),
('916b9e49-e0f6-421b-bcf8-793a9bd6b6f2', '16e79279-f359-4ee0-a412-bde7ffb70b38', 'अध्यक्ष', 2),
('0f2a0425-e97f-400a-824e-4034fb77fab7', 'a0e4e581-7604-4ee3-aee0-c90440a99327', 'उपाध्यक्ष', 2),
('6e34154e-b47d-4766-8829-9b5e22b7ca9d', '9435f7d9-1542-49f3-99f0-bc689035734a', 'केंद्रीय सचिव', 2),
('86274f9d-bf6e-46c8-8d3c-d65ee14c6221', '68cdd20f-249d-4898-a0df-25858f335022', 'कोषाध्यक्ष', 2),
('38d2fa8c-97a6-40f2-b03c-4e4d92161fda', '68519c66-9c79-4ed4-a01f-f5a7378f682b', 'कोषाध्यक्ष', 2),
('dadd887c-2229-4b9d-b812-b328a1206ecd', 'dad1b814-1c93-4865-ab90-dbb8f6591aa3', 'महासचिव', 2),
('d5693112-c6f2-4f88-9155-5c16b59618ab', '7a3fb589-6661-4d2f-92dd-955f25e617c3', 'महासचिव', 2),
('498adaf7-cd05-4295-8997-c78a2a51c9fa', '561ab956-97d6-4aae-b696-f0f523b8b2f7', 'सत्र संयोजक', 2),
('87cd2d44-643f-462a-963e-d27fe26f5337', '561ab956-97d6-4aae-b696-f0f523b8b2f7', 'केंद्रीय महासचिव', 3),
('18d455a7-9e1a-4329-928a-d9e379982b09', 'dad1b814-1c93-4865-ab90-dbb8f6591aa3', 'कोषाध्यक्ष', 3),
('1044dc70-004b-4eda-9e87-53536f1a4e2a', '2629c754-c8aa-4fef-b721-3a2201661b99', 'कोषाध्यक्ष', 3),
('962b91d5-d890-4e09-b0d3-ae5394321450', '7a3fb589-6661-4d2f-92dd-955f25e617c3', 'कोषाध्यक्ष', 3),
('84a11851-2bec-4629-bda6-8539dd4b98a1', 'a0e4e581-7604-4ee3-aee0-c90440a99327', 'राष्ट्रीय महासचिव', 3),
('f8b72d1f-4191-44a4-af46-221c0f4db203', '2629c754-c8aa-4fef-b721-3a2201661b99', 'महासचिव', 4);

